Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum
The distributed load unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.KG_M
Kilogram per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.TON_M
Ton per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.N_M
Newton per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.DAN_M
daNewton per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.KN_M
kNewton per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.LBF_IN
Lbf per inch.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.LBF_FT
Lbf per feet.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.KIP_IN
Kip per inch.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.KIP_FT
Kip per feet.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitEnum.UNKNOWN
unknown unit.